@jacobbednarz I've trimmed it so it's only showing two resources, but in reality, we have dozens of dns records, which all have drift in the same way.


```
› TF_LOG=DEBUG terraform apply
2025-03-24T13:16:08.020+1300 [INFO]  Terraform version: 1.11.2
2025-03-24T13:16:08.020+1300 [DEBUG] using github.com/hashicorp/go-tfe v1.70.0
2025-03-24T13:16:08.020+1300 [DEBUG] using github.com/hashicorp/hcl/v2 v2.23.0
2025-03-24T13:16:08.020+1300 [DEBUG] using github.com/hashicorp/terraform-svchost v0.1.1
2025-03-24T13:16:08.020+1300 [DEBUG] using github.com/zclconf/go-cty v1.16.0
2025-03-24T13:16:08.020+1300 [INFO]  Go runtime version: go1.23.3
2025-03-24T13:16:08.020+1300 [INFO]  CLI args: []string{"terraform", "apply"}
2025-03-24T13:16:08.020+1300 [DEBUG] Attempting to open CLI config file: /Users/kieran/.terraformrc
2025-03-24T13:16:08.020+1300 [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2025-03-24T13:16:08.021+1300 [INFO]  Loading CLI configuration from /Users/kieran/.terraform.d/credentials.tfrc.json
2025-03-24T13:16:08.021+1300 [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2025-03-24T13:16:08.021+1300 [DEBUG] ignoring non-existing provider search directory /Users/kieran/.terraform.d/plugins
2025-03-24T13:16:08.021+1300 [DEBUG] ignoring non-existing provider search directory /Users/kieran/Library/Application Support/io.terraform/plugins
2025-03-24T13:16:08.021+1300 [DEBUG] ignoring non-existing provider search directory /Library/Application Support/io.terraform/plugins
2025-03-24T13:16:08.022+1300 [INFO]  CLI command args: []string{"apply"}
2025-03-24T13:16:08.046+1300 [DEBUG] Service discovery for app.terraform.io at https://app.terraform.io/.well-known/terraform.json
2025-03-24T13:16:10.235+1300 [DEBUG] Service discovery for app.terraform.io aliased as localterraform.com
2025-03-24T13:16:12.146+1300 [DEBUG] checking for provisioner in "."
2025-03-24T13:16:12.149+1300 [DEBUG] checking for provisioner in "/opt/homebrew/bin"
2025-03-24T13:16:12.444+1300 [INFO]  cloud: starting Apply operation
Running apply in HCP Terraform. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/xpand/infra/runs/run-REDACTED

Waiting for the plan to start...

Terraform v1.11.2
on linux_amd64
Initializing plugins and modules...

cloudflare_dns_record.mx_1: Drift detected (update)
cloudflare_ruleset.xpand_nz_redirect: Drift detected (update)
2025-03-24T13:14:21.722+1300 [DEBUG] performing request: method=GET url=https://app.terraform.io/api/v2/plans/plan-REDACTED/json-output-redacted

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

# cloudflare_dns_record.mx_1 will be updated in-place
~ resource "cloudflare_dns_record" "mx_1" {
    + comment             = (known after apply)
    + comment_modified_on = (known after apply)
    ~ created_on          = "2025-02-18T05:47:14Z" -> (known after apply)
    + data                = (known after apply)
      id                  = "[REDACTED]"
    ~ meta                = jsonencode({}) -> (known after apply)
    ~ modified_on         = "2025-02-18T05:47:14Z" -> (known after apply)
    ~ name                = "xpand.io" -> "@"
    ~ proxiable           = false -> (known after apply)
    ~ settings            = {
        + flatten_cname = (known after apply)
        + ipv4_only     = (known after apply)
        + ipv6_only     = (known after apply)
      } -> (known after apply)
      tags                = []
    + tags_modified_on    = (known after apply)
      # (6 unchanged attributes hidden)
  }

# cloudflare_ruleset.xpand_nz_redirect will be updated in-place
~ resource "cloudflare_ruleset" "xpand_nz_redirect" {
    id          = "[REDACTED]"
    name        = "default"
  ~ rules       = [
      ~ {
          ~ action_parameters        = {
              + algorithms                 = (known after apply)
              + autominify                 = (known after apply)
              + browser_ttl                = (known after apply)
              + cache_key                  = (known after apply)
              + cache_reserve              = (known after apply)
              + cookie_fields              = (known after apply)
              + edge_ttl                   = (known after apply)
              + from_list                  = (known after apply)
              + headers                    = (known after apply)
              + matched_data               = (known after apply)
              + origin                     = (known after apply)
              + overrides                  = (known after apply)
              + raw_response_fields        = (known after apply)
              + request_fields             = (known after apply)
              + response                   = (known after apply)
              + response_fields            = (known after apply)
              + serve_stale                = (known after apply)
              + sni                        = (known after apply)
              + transformed_request_fields = (known after apply)
              + uri                        = (known after apply)
                # (1 unchanged attribute hidden)
            }
          + categories               = (known after apply)
          + exposed_credential_check = (known after apply)
          ~ id                       = "[REDACTED]" -> (known after apply)
          + logging                  = (known after apply)
          + ratelimit                = (known after apply)
          ~ ref                      = "[REDACTED]" -> (known after apply)
            # (4 unchanged attributes hidden)
        },
    ]
    # (4 unchanged attributes hidden)
}

Plan: 0 to add, 2 to change, 0 to destroy.
2025-03-24T13:14:25.615+1300 [DEBUG] command: asking for input: "\nDo you want to perform these actions in workspace \"infra\"?"

Do you want to perform these actions in workspace "infra"?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes
  
cloudflare_dns_record.xpand_nz_root: Modifying... [id=REDACTED]
cloudflare_dns_record.xpand_nz_root: Modifications complete after 1s [id=REDACTED]
cloudflare_dns_record.mx_1: Modifying... [id=REDACTED]
cloudflare_dns_record.mx_1: Modifications complete after 1s [id=REDACTED]

Apply complete! Resources: 0 added, 2 changed, 0 destroyed.
```